<a href="https://colab.research.google.com/github/plthiyagu/Personnel/blob/master/missing_Values.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [ ]:
df= pd.read_csv('https://raw.githubusercontent.com/plthiyagu/Personnel/master/Dataset/titanic.csv')
df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [ ]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [ ]:
df.isnull().mean()

PassengerId    0.000000
Survived       0.000000
Pclass         0.000000
Name           0.000000
Sex            0.000000
Age            0.198653
SibSp          0.000000
Parch          0.000000
Ticket         0.000000
Fare           0.000000
Cabin          0.771044
Embarked       0.002245
dtype: float64

In [ ]:
df['cabin_null'] = np.where(df.Cabin.isnull(), 1, 0)
# find percentage of null values
df.cabin_null.mean()

0.7710437710437711

In [ ]:
df.groupby(['Survived'])['cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: cabin_null, dtype: float64

In [ ]:
df['age_null'] = np.where(df.Age.isnull(), 1, 0)

In [ ]:
df.groupby(['Survived'])['age_null'].mean()

Survived
0    0.227687
1    0.152047
Name: age_null, dtype: float64

In [ ]:
df[df.Embarked.isnull()]

     PassengerId  Survived  Pclass  ... Embarked cabin_null  age_null
61            62         1       1  ...      NaN          0         0
829          830         1       1  ...      NaN          0         0

[2 rows x 14 columns]

In [ ]:
df_loan= pd.read_csv('https://raw.githubusercontent.com/plthiyagu/Personnel/master/Dataset//LoanStats_2018Q4.csv').sample(
        10000, random_state=44)
df_loan.head()

/usr/local/lib/python3.6/dist-packages/IPython/core/interactiveshell.py:2718: DtypeWarning: Columns (0,123,124,125,128,129,130,133,139,140,141) have mixed types.Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

         id  member_id  ...  settlement_percentage  settlement_term
39437   NaN        NaN  ...                    NaN              NaN
101867  NaN        NaN  ...                    NaN              NaN
90842   NaN        NaN  ...                    NaN              NaN
71803   NaN        NaN  ...                    NaN              NaN
18012   NaN        NaN  ...                    NaN              NaN

[5 rows x 145 columns]

In [ ]:
print('Number of different employer names: {}'.format(len(df_loan.emp_title.unique())))
df_loan.emp_title.unique()[0:20]

Number of different employer names: 5288

array(['Project Coordinator', 'Back office manager ', 'Pressman',
       'Office Manager', 'Property Manager', 'Denial Specialist',
       'Bakery/Deli Manager', nan, 'Front office manager ', 'Accountant',
       'Registered nurse', 'Supervisory Mission Support Specialist',
       'Registered Nurse', 'Caretaker',
       'School Psych./Behavioral Specialist', 'GRAPHIC DESIGNER',
       'Preschool Director ', 'Water Plant operator', 'registered nurse',
       'Paramedic '], dtype=object)

In [ ]:
df_loan.emp_length.unique()

array(['< 1 year', '6 years', '10+ years', '7 years', '3 years',
       '2 years', '1 year', '5 years', '4 years', '9 years', nan,
       '8 years'], dtype=object)

In [ ]:
df_loan.emp_length.value_counts() / len(df_loan)

10+ years    0.3080
< 1 year     0.1209
2 years      0.0841
3 years      0.0744
1 year       0.0707
5 years      0.0613
4 years      0.0587
6 years      0.0412
7 years      0.0332
8 years      0.0319
9 years      0.0228
Name: emp_length, dtype: float64

In [ ]:
length_dict = {k:'0-10 years' for k in df_loan.emp_length.unique()}
length_dict['10+ years']='10+ years'
length_dict['n/a']='n/a'

# let's look at the dictionary
length_dict

{'1 year': '0-10 years',
 '10+ years': '10+ years',
 '2 years': '0-10 years',
 '3 years': '0-10 years',
 '4 years': '0-10 years',
 '5 years': '0-10 years',
 '6 years': '0-10 years',
 '7 years': '0-10 years',
 '8 years': '0-10 years',
 '9 years': '0-10 years',
 '< 1 year': '0-10 years',
 'n/a': 'n/a',
 nan: '0-10 years'}